; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v10 ?v3)
             (pred_11 ?v8 ?v11)
             (pred_2 ?v10 ?v11)
             (pred_8 ?v9 ?v10 )
	     (pred_10 ?v10)
             (pred_1 ?v13)
             (pred_4 ?v8)
             (pred_3 ?v11)
             (pred_5 ?v10)
             (pred_9 ?v8)
             (pred_7 ?v10)
             (pred_6 ))



(:action op_3
:parameters (?v2 ?v6 ?v1 ?v7)
:precondition (and (pred_1 ?v2) (pred_1 ?v6) (pred_4 ?v1) (pred_3 ?v7)
          (pred_12 ?v2 ?v6) (pred_11 ?v1 ?v7)
                   (pred_2 ?v6 ?v7) (pred_10 ?v2) 
                   (pred_5 ?v6) (pred_9 ?v1))
:effect (and  (pred_7 ?v6) (not (pred_5 ?v6))))


(:action op_4
:parameters (?v2 ?v12)
:precondition (and (pred_1 ?v2) (pred_1 ?v12)
               (pred_10 ?v2) (pred_12 ?v2 ?v12) (pred_7 ?v12))
:effect (and (pred_10 ?v12) (not (pred_10 ?v2))))

(:action op_1
:parameters (?v2 ?v1)
:precondition (and (pred_1 ?v2) (pred_4 ?v1) 
                  (pred_10 ?v2) (pred_8 ?v1 ?v2) (pred_6 ))
:effect (and (pred_9 ?v1)
   (not (pred_8 ?v1 ?v2)) (not (pred_6 ))))


(:action op_5
:parameters (?v2 ?v5 ?v4)
:precondition (and (pred_1 ?v2) (pred_4 ?v5) (pred_4 ?v4)
                  (pred_10 ?v2) (pred_9 ?v4) (pred_8 ?v5 ?v2))
:effect (and (pred_9 ?v5) (pred_8 ?v4 ?v2)
        (not (pred_9 ?v4)) (not (pred_8 ?v5 ?v2))))

(:action op_2
:parameters (?v2 ?v1)
:precondition (and (pred_1 ?v2) (pred_4 ?v1) 
                  (pred_10 ?v2) (pred_9 ?v1))
:effect (and (pred_6 ) (pred_8 ?v1 ?v2) (not (pred_9 ?v1)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_28 obj_30 obj_27 obj_18 obj_17 obj_09 obj_13 obj_25 obj_06 obj_08 obj_26 obj_16 obj_24 obj_05 obj_15 obj_11 obj_20 obj_23 obj_14 obj_22 obj_02 obj_04 obj_19 obj_03 obj_07
    obj_01 obj_10
    obj_21 obj_29 obj_12
    )

    (:init
       (pred_6)

       (pred_1 obj_28)
       (pred_1 obj_30)
       (pred_1 obj_27)
       (pred_1 obj_18)
       (pred_1 obj_17)
       (pred_1 obj_09)
       (pred_1 obj_13)
       (pred_1 obj_25)
       (pred_1 obj_06)
       (pred_1 obj_08)
       (pred_1 obj_26)
       (pred_1 obj_16)
       (pred_1 obj_24)
       (pred_1 obj_05)
       (pred_1 obj_15)
       (pred_1 obj_11)
       (pred_1 obj_20)
       (pred_1 obj_23)
       (pred_1 obj_14)
       (pred_1 obj_22)
       (pred_1 obj_02)
       (pred_1 obj_04)
       (pred_1 obj_19)
       (pred_1 obj_03)
       (pred_1 obj_07)
       (pred_3 obj_01)
       (pred_3 obj_10)
       (pred_4 obj_21)
       (pred_4 obj_29)
       (pred_4 obj_12)

       (pred_12 obj_28 obj_09)
       (pred_12 obj_28 obj_30)
       (pred_12 obj_30 obj_13)
       (pred_12 obj_30 obj_27)
       (pred_12 obj_30 obj_28)
       (pred_12 obj_27 obj_25)
       (pred_12 obj_27 obj_18)
       (pred_12 obj_27 obj_30)
       (pred_12 obj_18 obj_06)
       (pred_12 obj_18 obj_17)
       (pred_12 obj_18 obj_27)
       (pred_12 obj_17 obj_08)
       (pred_12 obj_17 obj_18)
       (pred_12 obj_09 obj_26)
       (pred_12 obj_09 obj_13)
       (pred_12 obj_09 obj_28)
       (pred_12 obj_13 obj_16)
       (pred_12 obj_13 obj_25)
       (pred_12 obj_13 obj_30)
       (pred_12 obj_13 obj_09)
       (pred_12 obj_25 obj_24)
       (pred_12 obj_25 obj_06)
       (pred_12 obj_25 obj_27)
       (pred_12 obj_25 obj_13)
       (pred_12 obj_06 obj_05)
       (pred_12 obj_06 obj_08)
       (pred_12 obj_06 obj_18)
       (pred_12 obj_06 obj_25)
       (pred_12 obj_08 obj_15)
       (pred_12 obj_08 obj_17)
       (pred_12 obj_08 obj_06)
       (pred_12 obj_26 obj_11)
       (pred_12 obj_26 obj_16)
       (pred_12 obj_26 obj_09)
       (pred_12 obj_16 obj_20)
       (pred_12 obj_16 obj_24)
       (pred_12 obj_16 obj_13)
       (pred_12 obj_16 obj_26)
       (pred_12 obj_24 obj_23)
       (pred_12 obj_24 obj_05)
       (pred_12 obj_24 obj_25)
       (pred_12 obj_24 obj_16)
       (pred_12 obj_05 obj_14)
       (pred_12 obj_05 obj_15)
       (pred_12 obj_05 obj_06)
       (pred_12 obj_05 obj_24)
       (pred_12 obj_15 obj_22)
       (pred_12 obj_15 obj_08)
       (pred_12 obj_15 obj_05)
       (pred_12 obj_11 obj_02)
       (pred_12 obj_11 obj_20)
       (pred_12 obj_11 obj_26)
       (pred_12 obj_20 obj_04)
       (pred_12 obj_20 obj_23)
       (pred_12 obj_20 obj_16)
       (pred_12 obj_20 obj_11)
       (pred_12 obj_23 obj_19)
       (pred_12 obj_23 obj_14)
       (pred_12 obj_23 obj_24)
       (pred_12 obj_23 obj_20)
       (pred_12 obj_14 obj_03)
       (pred_12 obj_14 obj_22)
       (pred_12 obj_14 obj_05)
       (pred_12 obj_14 obj_23)
       (pred_12 obj_22 obj_07)
       (pred_12 obj_22 obj_15)
       (pred_12 obj_22 obj_14)
       (pred_12 obj_02 obj_04)
       (pred_12 obj_02 obj_11)
       (pred_12 obj_04 obj_19)
       (pred_12 obj_04 obj_20)
       (pred_12 obj_04 obj_02)
       (pred_12 obj_19 obj_03)
       (pred_12 obj_19 obj_23)
       (pred_12 obj_19 obj_04)
       (pred_12 obj_03 obj_07)
       (pred_12 obj_03 obj_14)
       (pred_12 obj_03 obj_19)
       (pred_12 obj_07 obj_22)
       (pred_12 obj_07 obj_03)
       (pred_5 obj_22)
       (pred_5 obj_18)
       (pred_5 obj_11)
       (pred_2  obj_22 obj_01)
       (pred_2  obj_18 obj_10)
       (pred_2  obj_11 obj_10)
       (pred_7 obj_28)
       (pred_7 obj_30)
       (pred_7 obj_27)
       (pred_7 obj_17)
       (pred_7 obj_09)
       (pred_7 obj_13)
       (pred_7 obj_25)
       (pred_7 obj_06)
       (pred_7 obj_08)
       (pred_7 obj_26)
       (pred_7 obj_16)
       (pred_7 obj_24)
       (pred_7 obj_05)
       (pred_7 obj_15)
       (pred_7 obj_20)
       (pred_7 obj_23)
       (pred_7 obj_14)
       (pred_7 obj_02)
       (pred_7 obj_04)
       (pred_7 obj_19)
       (pred_7 obj_03)
       (pred_7 obj_07)

       (pred_11  obj_21 obj_01)
       (pred_11  obj_29 obj_10)
       (pred_11  obj_12 obj_10)
       (pred_8 obj_21 obj_17)
       (pred_8 obj_29 obj_17)
       (pred_8 obj_12 obj_27)
       (pred_10 obj_06)
    )

    (:goal (and
       (pred_8 obj_21 obj_23)
       (pred_8 obj_29 obj_14)
       (pred_8 obj_12 obj_30)
    ))
(:constraints
  (always (not (pred_10 obj_05)))
)
)

; plan
1. (op_4 obj_06 obj_08)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_08)
   goals met: 0 of 3
2. (op_4 obj_08 obj_17)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_17)
   goals met: 0 of 3
3. (op_1 obj_17 obj_21)
   deleted: (pred_8 obj_21 obj_17) (pred_6)
   added: (pred_9 obj_21)
   goals met: 0 of 3
4. (op_4 obj_17 obj_08)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_08)
   goals met: 0 of 3
5. (op_4 obj_08 obj_06)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_06)
   goals met: 0 of 3
6. (op_4 obj_06 obj_25)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_25)
   goals met: 0 of 3
7. (op_4 obj_25 obj_27)
   deleted: (pred_10 obj_25)
   added: (pred_10 obj_27)
   goals met: 0 of 3
8. (op_4 obj_27 obj_30)
   deleted: (pred_10 obj_27)
   added: (pred_10 obj_30)
   goals met: 0 of 3
9. (op_2 obj_30 obj_21)
   deleted: (pred_9 obj_21)
   added: (pred_6) (pred_8 obj_21 obj_30)
   goals met: 0 of 3
10. (op_4 obj_30 obj_27)
   deleted: (pred_10 obj_30)
   added: (pred_10 obj_27)
   goals met: 0 of 3
11. (op_1 obj_27 obj_12)
   deleted: (pred_8 obj_12 obj_27) (pred_6)
   added: (pred_9 obj_12)
   goals met: 0 of 3
12. (op_3 obj_27 obj_18 obj_12 obj_10)
   deleted: (pred_5 obj_18)
   added: (pred_7 obj_18)
   goals met: 0 of 3
13. (op_4 obj_27 obj_30)
   deleted: (pred_10 obj_27)
   added: (pred_10 obj_30)
   goals met: 0 of 3
14. (op_5 obj_30 obj_21 obj_12)
   deleted: (pred_9 obj_12) (pred_8 obj_21 obj_30)
   added: (pred_9 obj_21) (pred_8 obj_12 obj_30)
   goals met: 1 of 3
15. (op_4 obj_30 obj_27)
   deleted: (pred_10 obj_30)
   added: (pred_10 obj_27)
   goals met: 1 of 3
16. (op_4 obj_27 obj_18)
   deleted: (pred_10 obj_27)
   added: (pred_10 obj_18)
   goals met: 1 of 3
17. (op_4 obj_18 obj_17)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_17)
   goals met: 1 of 3
18. (op_4 obj_17 obj_08)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_08)
   goals met: 1 of 3
19. (op_4 obj_08 obj_15)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_15)
   goals met: 1 of 3
20. (op_3 obj_15 obj_22 obj_21 obj_01)
   deleted: (pred_5 obj_22)
   added: (pred_7 obj_22)
   goals met: 1 of 3
21. (op_4 obj_15 obj_22)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_22)
   goals met: 1 of 3
22. (op_4 obj_22 obj_14)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_14)
   goals met: 1 of 3
23. (op_4 obj_14 obj_23)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_23)
   goals met: 1 of 3
24. (op_2 obj_23 obj_21)
   deleted: (pred_9 obj_21)
   added: (pred_6) (pred_8 obj_21 obj_23)
   goals met: 2 of 3
25. (op_4 obj_23 obj_14)
   deleted: (pred_10 obj_23)
   added: (pred_10 obj_14)
   goals met: 2 of 3
26. (op_4 obj_14 obj_22)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_22)
   goals met: 2 of 3
27. (op_4 obj_22 obj_15)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_15)
   goals met: 2 of 3
28. (op_4 obj_15 obj_08)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_08)
   goals met: 2 of 3
29. (op_4 obj_08 obj_17)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_17)
   goals met: 2 of 3
30. (op_1 obj_17 obj_29)
   deleted: (pred_8 obj_29 obj_17) (pred_6)
   added: (pred_9 obj_29)
   goals met: 2 of 3
31. (op_4 obj_17 obj_08)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_08)
   goals met: 2 of 3
32. (op_4 obj_08 obj_15)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_15)
   goals met: 2 of 3
33. (op_4 obj_15 obj_22)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_22)
   goals met: 2 of 3
34. (op_4 obj_22 obj_14)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_14)
   goals met: 2 of 3
35. (op_2 obj_14 obj_29)
   deleted: (pred_9 obj_29)
   added: (pred_6) (pred_8 obj_29 obj_14)
   goals met: 3 of 3
